Catalogs/ДатаМобайл_Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДатаМобайл_Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДатаМобайл_Пользователи/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	Если Ссылка.Пустая() Тогда
		ПроверитьНаДубльПоПользователю(Отказ);	   
	КонецЕсли; 
	
	Если Не ПустаяСтрока(Логин) Тогда
		ПроверитьНаУникальностьШтрихкод(Логин, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаДубльПоПользователю(Отказ)
	
	Если Не Справочники.ДатаМобайл_Пользователи.НайтиПоРеквизиту("Пользователь1С", ЭтотОбъект.Пользователь1С).Пустая() Тогда
		Отказ = Истина;
		Сообщить("Данный пользователь был добавлен.");
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	Если Не Этотобъект.ДополнительныеСвойства.Свойство("НеВыполнятьКонтрольУдаляемых") Тогда
		Сообщить("Непосредственное удаление запрещено, могут остаться битые ссылки!");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаУникальностьШтрихкод(Логин, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаМобайл_Пользователи.Ссылка КАК Пользователь,
	|	ДатаМобайл_Пользователи.Логин КАК Штрихкод,
	|	ДатаМобайл_Пользователи.Пользователь1С.Наименование КАК ПользовательПредставление
	|ИЗ
	|	Справочник.ДатаМобайл_Пользователи КАК ДатаМобайл_Пользователи
	|ГДЕ
	|	ДатаМобайл_Пользователи.Логин = &Штрихкод
	|";
	
	СтрокаШтрихкода = СокрП(Логин);
	Запрос.УстановитьПараметр("Штрихкод", СтрокаШтрихкода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Ссылка <> Выборка.Пользователь Тогда
			ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для пользователя %Пользователь%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Пользователь%", Выборка.ПользовательПредставление);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Поле = "Запись.Штрихкод";
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
